#-------------------------------------------------------------------------------
# Name:        Lesson_1
# Purpose:
#
# Author:      Владимир
#
# Created:     25.09.2022
# Copyright:   (c) Владимир 2022
# Licence:     <your licence>
#-------------------------------------------------------------------------------
##1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
##*Пример:*
##
##- 6 -> да
##- 7 -> да
##- 1 -> нет

##weekday = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскрксенье']
##
##number = int(input('Веедите число от 1 до 7 -->  '))
##
##if number > 7 or number < 1:
##    print('Ваш ввод вне диапозона от 1 до 7 ')
##elif number == 6 or number == 7:
##    print(number, ' - ', weekday[number-1], '--', "Да, этот день выходной")
##else:
##    print(number, ' - ', weekday[number-1], '--', "Нет, этот день не выходной")

##---------------------------------------------------------------------------
##2. Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

##for x in range(2):
##    for y in range(2):
##        for z in range(2):
##            if (not (x or y or z)) == (not (x) and not (y) and not (z)):
##                print(x,y,z)

##---------------------------------------------------------------------------


##3. Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
##*Пример:*
##
##- x=34; y=-30 -> 4
##- x=2; y=4-> 1
##- x=-34; y=-30 -> 3

##x = int(input('Введите координату X --> '))
##y = int(input('Введите координату Y --> '))
##
##if (x or y) == 0:
##    print('Координаты X и Y не могут быть равны 0')
##elif x > 0 and y > 0:
##    print('X = ', x, 'Y = ', y, '-->',  1)
##elif x < 0 and y > 0:
##    print('X = ', x, 'Y = ', y, '-->',  2)
##elif x < 0 and y < 0:
##    print('X = ', x, 'Y = ', y, '-->',  3)
##elif x > 0 and y < 0:
##    print('X = ', x, 'Y = ', y, '-->',  4)

##--------------------------------------------------------------------------

##4. Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
##*Пример:*
##
##- 1 --> x > 0, y > 0
##- 3 --> x < 0, y < 0

##try:
##    quarter_number = int(input('Введите номер координатной четверти от 1 до 4 --> '))
##    if quarter_number == 0 or quarter_number > 4:
##        print('Четверть не может быть определена "Вы вышли за диапазон от 1 до 4')
##    elif quarter_number == 1:
##        print(quarter_number, '-->', 'x > 0 and y > 0')
##    elif quarter_number == 2:
##        print(quarter_number, '-->', 'x < 0 and y > 0')
##    elif quarter_number == 3:
##        print(quarter_number, '-->', 'x < 0 and y < 0')
##    elif quarter_number == 4:
##        print(quarter_number, '-->', 'x > 0 and y < 0')
##except ValueError:
##    print('Некорректный ввод')


##5. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

def fun2D(x1, y1, x2, y2):
    distance = f'{(((x2 - x1)**2) + ((y2 - y1)**2))**0.5:.3f}'
    return distance




